In [1]:
import pandas as pd

## Process the relationship between SA2 SUA and State
data collected from: https://www.abs.gov.au/AUSSTATS/abs@.nsf/DetailsPage/1270.0.55.001July%202016?OpenDocument

In [5]:
SA2_S = pd.read_csv(r'SUDO/SA2_State.csv')
SA2_SUA = pd.read_csv(r'SUDO/SA2_SUA.csv')
join_SA2_SUA = SA2_SUA[['SA2_MAINCODE_2016','SUA_NAME_2016','SUA_CODE_2016']]
join_SA2_S = SA2_S[['SA2_MAINCODE_2016']]

In [6]:
joined_area = pd.merge(join_SA2_SUA, join_SA2_S, how='inner', on = 'SA2_MAINCODE_2016')
joined_area

,SA2_MAINCODE_2016,SUA_NAME_2016,SUA_CODE_2016
0,101021007,Not in any Significant Urban Area (NSW),1000
1,101021008,Canberra - Queanbeyan,8001
2,101021009,Canberra - Queanbeyan,8001
3,101021010,Canberra - Queanbeyan,8001
4,101021011,Not in any Significant Urban Area (NSW),1000
...,...,...,...
2305,901021002,Not in any Significant Urban Area (OT),9000
2306,901031003,Not in any Significant Urban Area (OT),9000
2307,901041004,Not in any Significant Urban Area (OT),9000
2308,997979799,Not in any Significant Urban Area (OT),9000
2309,999999499,Not in any Significant Urban Area (OT),9000

## Preprocess SUDO data
dataset name: 
- SA2-P40a Labour Force Status by Age by Sex-Census 2016
- SA2-P40b Labour Force Status by Age by Sex-Census 2016

In [4]:
all_a = pd.read_csv(r'SUDO\SA2-P40_Labour_Force_Status-CSV\sa2_p40a_data.csv').drop(' sa2_name16',axis = 1)
all_b = pd.read_csv(r'SUDO\SA2-P40_Labour_Force_Status-CSV\sa2_p40b_data.csv')

In [5]:
joined_all = pd.merge(all_a, all_b, how='inner', on = ' sa2_main16')

In [6]:
joined_all

,m_n_the_lf_15_19,m_emp_a_f_wrk_75_84,m_ue_lk_fr_ft_wrk_25_34,f_emp_wrk_ft_75_84,f_tot_emp_65_74,f_emp_a_f_wrk_75_84,f_emp_wrk_ft_65_74,f_tot_unemp_15_19,m_ue_lk_for_pt_wk_15_19,f_tot_unemp_total,...,p_tot_75_84_yr,p_tot_25_34_yr,f_tot_lf_45_54_yr,f_n_the_lf_tot,p_tot_unemp_35_44,p_emp_wrk_pt_65_74,f_lf_st_ns_65_74,p_lf_st_ns_75_84,p_ue_lk_fr_ft_wrk_15_19,f_tot_85_yr_over
0,41,0,4,0,58,0,26,0,3,28,...,234,292,203,616,5,75,43,26,4,51
1,115,0,15,0,46,0,18,23,12,94,...,302,1083,495,1045,34,49,20,25,17,59
2,57,0,0,9,59,0,27,4,0,24,...,197,258,224,460,3,54,22,28,0,19
3,199,3,14,8,160,0,55,12,15,73,...,438,2883,958,1363,28,221,124,77,8,42
4,67,0,22,3,48,0,14,9,7,101,...,703,677,310,1663,37,65,60,111,13,189
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2286,0,0,0,0,0,0,0,0,0,0,...,0,4,0,0,0,0,0,0,0,0
2287,19,0,8,0,9,0,0,0,0,20,...,19,435,60,128,14,9,0,0,0,0
2288,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2289,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,3,0
2290,14,0,4,0,8,0,0,0,0,22,...,19,911,98,161,9,11,0,0,0,0

### employment state 
for employment ratio calculation: ER = employed people / (total people - people not give labour force state) * 100%
- Assumption: the distribution for labour force states of persons labour force status not stated is the same as the area's labour force states distribution

In [7]:
import re

for col_name in list(joined_all.columns):
    if 'tot' in col_name and not re.search('[a-zA-Z].*\d|\d.*[a-zA-Z]', col_name) and col_name[1] == 'p':
        print(col_name)

 p_tot_emp_tot
 p_n_the_lf_tot
 p_tot_unemp_total
 p_emp_wrk_pt_tot
 p_hr_wrk_ns_tot
 p_emp_a_f_wrk_tot
 p_tot_tot
 p_emp_wrk_ft_tot
 p_lf_st_ns_total
 p_ue_looking_for_ft_wk_tot
 p_ue_lk_for_pt_wrk_tot
 p_tot_lf_tot

- p_tot_emp_tot: Persons Total employed Total
- p_n_the_lf_tot: Persons Not in the labour force Total
- p_tot_unemp_total: Persons Total unemployed Total
- p_emp_wrk_pt_tot: Persons Employed worked Part-time Total
- p_hr_wrk_ns_tot: Persons Hours worked not stated Total
- p_emp_a_f_wrk_tot: Persons Employed away from work Total
- p_tot_tot: Persons Total Total
- p_emp_wrk_ft_tot: Persons Employed worked Full-time Total
- p_lf_st_ns_total: Persons Labour force status not stated Total
- p_ue_looking_for_ft_wk_tot: Persons Unemployed looking for Full-time work Total
- p_ue_lk_for_pt_wrk_tot: Persons Unemployed looking for Part-time work Total
- p_tot_lf_tot: Persons Total labour force Total

In [8]:
emp_df = joined_all[[' p_tot_emp_tot',' p_tot_tot',' p_lf_st_ns_total',' sa2_main16']].rename(columns={' p_tot_emp_tot': 'people_employed',' sa2_main16':'SA2_maincode'})
emp_df['people_total'] = emp_df[' p_tot_tot']-emp_df[' p_lf_st_ns_total']
emp_df = emp_df[['people_total','people_employed','SA2_maincode']]
emp_df

      people_total  people_employed  SA2_maincode
0             2781             1600     101021007
1             6202             4187     101021008
2             2614             1681     101031015
3            13017            10089     101031016
4             5901             2606     101041017
...            ...              ...           ...
2286             4                3     801101134
2287          1242             1004     801101135
2288             0                0     801101136
2289             5                4     801101138
2290          2095             1814     801101139

[2291 rows x 3 columns]

### gender
for Gender ratio calculation: GR = (Number of males / Number of females) * 100%

- m_tot_tot: Males Total Total
- f_tot_tot: Females Total Total

In [9]:
gender_df = joined_all[[' m_tot_tot',' f_tot_tot',' sa2_main16']].rename(columns={' m_tot_tot': 'males',' f_tot_tot':'females',' sa2_main16':'SA2_maincode'})
gender_df

      males  females  SA2_maincode
0      1569     1575     101021007
1      3211     3364     101021008
2      1466     1423     101031015
3      8877     7066     101031016
4      3187     3292     101041017
...     ...      ...           ...
2286     16       14     801101134
2287    634      695     801101135
2288      0        0     801101136
2289      7        3     801101138
2290   1061     1188     801101139

[2291 rows x 3 columns]

### age range
find the most popular age range in each area: mode 

calculate the percentage of people in this age stage in the area: (mode / tot_people) * 100%

In [10]:
for col_name in list(joined_all.columns):
    if col_name[1:7] == 'p_tot_' and 'emp' not in col_name and 'lf' not in col_name and col_name != ' p_tot_tot':
        print(col_name)

 p_tot_15_19_yr
 p_tot_55_64_yr
 p_tot_45_54_yr
 p_tot_85_yr_over
 p_tot_65_74_yr
 p_tot_20_24_yr
 p_tot_35_44_yr
 p_tot_75_84_yr
 p_tot_25_34_yr

In [11]:
import numpy as np

year_range = ['SA2_maincode','15_19_yr','20_24_yr','25_34_yr','35_44_yr','45_54_yr','55_64_yr','65_74_yr','75_84_yr','85_yr_over','total_people']
year_full = joined_all[[' sa2_main16', ' p_tot_15_19_yr', ' p_tot_20_24_yr', ' p_tot_25_34_yr', ' p_tot_35_44_yr',' p_tot_45_54_yr', ' p_tot_55_64_yr',
' p_tot_65_74_yr', ' p_tot_75_84_yr', ' p_tot_85_yr_over',' p_tot_tot']]
col_dict = dict(zip(year_full.columns, year_range))
year_full = year_full.rename(columns=col_dict)
year_full

,SA2_maincode,15_19_yr,20_24_yr,25_34_yr,35_44_yr,45_54_yr,55_64_yr,65_74_yr,75_84_yr,85_yr_over,total_people
0,101021007,178,113,292,423,562,665,582,234,83,3142
1,101021008,583,534,1083,1124,1202,1038,624,302,83,6570
2,101031015,225,123,258,412,572,574,486,197,42,2889
3,101031016,929,1551,2883,2961,2757,2606,1722,438,98,15944
4,101041017,360,281,677,751,914,1239,1254,703,296,6483
...,...,...,...,...,...,...,...,...,...,...,...
2286,801101134,3,4,4,6,0,8,3,0,0,29
2287,801101135,76,116,435,378,169,80,55,19,0,1335
2288,801101136,0,0,0,0,0,0,0,0,0,0
2289,801101138,6,0,0,0,7,0,0,0,0,5
2290,801101139,84,264,911,500,241,158,71,19,7,2248

## Merge SUDO with SUA

In [12]:
SUA_employ = pd.merge(joined_area, emp_df, how='inner', left_on = 'SA2_MAINCODE_2016', right_on='SA2_maincode')
SUA_employ = SUA_employ.drop(columns=['SA2_MAINCODE_2016','SA2_maincode'])

In [13]:
SUA_employ = SUA_employ.groupby(['SUA_NAME_2016','STATE_NAME_2016'])['people_total','people_employed'].sum()
SUA_employ = SUA_employ.reset_index()

# Find duplicate values in the 'Name' column
SUA_employ_dup = SUA_employ.duplicated(subset='SUA_NAME_2016', keep=False)
duplicate_rows = SUA_employ[SUA_employ_dup]

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_7776\853660220.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  SUA_employ = SUA_employ.groupby(['SUA_NAME_2016','STATE_NAME_2016'])['people_total','people_employed'].sum()

In [14]:
state_dict ={
    "New South Wales":" (NSW)",
    "Victoria":" (Vic.)",
    "Australian Capital Territory":" (ACT)",
    "South Australia":" (SA)",
    "Western Australia":" (WA)",
    "Tasmania":" (Tas.)",
    "Queensland":" (Qld)",
    "Northern Territory":" (NT)",
    "Other Territories":" (OT)"}

for idx,row in duplicate_rows.iterrows():
    if '(' not in row['SUA_NAME_2016']:
        SUA_employ.loc[idx, 'SUA_NAME_2016'] = row['SUA_NAME_2016'] + state_dict[row['STATE_NAME_2016']]
    
SUA_employ['employment_rate'] = SUA_employ['people_employed'] / SUA_employ['people_total'] * 100
SUA_employ

,SUA_NAME_2016,STATE_NAME_2016,people_total,people_employed,employment_rate
0,Adelaide,South Australia,993435,572587,57.637087
1,Albany,Western Australia,24753,14137,57.112269
2,Albury - Wodonga (NSW),New South Wales,37185,22254,59.846712
3,Albury - Wodonga (Vic.),Victoria,28819,18142,62.951525
4,Alice Springs,Northern Territory,18594,13102,70.463590
...,...,...,...,...,...
110,Warwick,Queensland,11320,6033,53.295053
111,Whyalla,South Australia,16214,8279,51.060812
112,Wollongong,New South Wales,218570,122653,56.116118
113,Yanchep,Western Australia,7847,4692,59.793552
114,Yeppoon,Queensland,13621,7501,55.069378

In [15]:
######################################### state only #############################################################

# state_emp = SUA_employ.groupby(['STATE_NAME_2016'])['people_total','people_employed'].sum()
# state_emp['employment rate'] = state_emp['people_employed'] / state_emp['people_total'] * 100
# state_emp.to_excel('state_emp.xlsx')

In [16]:
SUA_gender = pd.merge(joined_area, gender_df, how='inner', left_on = 'SA2_MAINCODE_2016', right_on='SA2_maincode')
SUA_gender = SUA_gender.drop(columns=['SA2_MAINCODE_2016','SA2_maincode'])

SUA_gender = SUA_gender.groupby(['SUA_NAME_2016','STATE_NAME_2016'])['males','females'].sum()
SUA_gender = SUA_gender.reset_index()

# Find duplicate values in the 'Name' column
SUA_gender_dup = SUA_gender.duplicated(subset='SUA_NAME_2016', keep=False)
duplicate_rows = SUA_gender[SUA_gender_dup]

for idx,row in duplicate_rows.iterrows():
    if '(' not in row['SUA_NAME_2016']:
        SUA_gender.loc[idx, 'SUA_NAME_2016'] = row['SUA_NAME_2016'] + state_dict[row['STATE_NAME_2016']]

SUA_gender['gender_ratio'] = SUA_gender['males'] / SUA_gender['females'] * 100
SUA_gender

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_7776\3566477836.py:4: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  SUA_gender = SUA_gender.groupby(['SUA_NAME_2016','STATE_NAME_2016'])['males','females'].sum()

,SUA_NAME_2016,STATE_NAME_2016,males,females,gender_ratio
0,Adelaide,South Australia,502651,539410,93.185332
1,Albany,Western Australia,12702,13638,93.136824
2,Albury - Wodonga (NSW),New South Wales,19227,20963,91.718743
3,Albury - Wodonga (Vic.),Victoria,14928,15788,94.552825
4,Alice Springs,Northern Territory,10439,11276,92.577155
...,...,...,...,...,...
110,Warwick,Queensland,5633,6348,88.736610
111,Whyalla,South Australia,8756,8705,100.585870
112,Wollongong,New South Wales,112172,118162,94.930688
113,Yanchep,Western Australia,4137,4537,91.183601
114,Yeppoon,Queensland,6913,7701,89.767563

In [17]:
######################################### state only #############################################################

# SUA_gender = SUA_gender.groupby(['STATE_NAME_2016'])['males','females'].sum()
# SUA_gender['gender_ratio'] = SUA_gender['males'] / SUA_gender['females'] * 100
# SUA_gender.to_excel('state_gender.xlsx')

In [18]:
# define a function to extract lower and upper bounds of age
def extract_age_range(age_str):
    lower, upper = re.findall(r'\d+', age_str)
    return f"{lower} to {upper} years-old"

In [19]:
SUA_age = pd.merge(joined_area, year_full, how='inner', left_on = 'SA2_MAINCODE_2016', right_on='SA2_maincode')
SUA_age = SUA_age.drop(columns=['SA2_MAINCODE_2016','SA2_maincode'])

SUA_age = SUA_age.groupby(['SUA_NAME_2016','STATE_NAME_2016'])['15_19_yr','20_24_yr','25_34_yr','35_44_yr','45_54_yr','55_64_yr','65_74_yr','75_84_yr','85_yr_over','total_people'].sum()
SUA_age = SUA_age.reset_index()

# Find duplicate values in the 'Name' column
SUA_age_dup = SUA_age.duplicated(subset='SUA_NAME_2016', keep=False)
duplicate_rows = SUA_age[SUA_age_dup]

for idx,row in duplicate_rows.iterrows():
    if '(' not in row['SUA_NAME_2016']:
        SUA_age.loc[idx, 'SUA_NAME_2016'] = row['SUA_NAME_2016'] + state_dict[row['STATE_NAME_2016']]

SUA_age['age_mode'] = SUA_age.iloc[:, 2:11].max(axis=1)
SUA_age['popular_age_range'] = SUA_age.iloc[:, 2:11].idxmax(axis=1)
SUA_age['popular_age_range'] = SUA_age['popular_age_range'].apply(extract_age_range)
SUA_age['age_range_percentage'] = SUA_age['age_mode'] / SUA_age['total_people'] * 100
SUA_puplar_age_range = SUA_age[['SUA_NAME_2016','STATE_NAME_2016','age_mode','total_people','popular_age_range']]
SUA_puplar_age_range

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_7776\1218050972.py:4: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  SUA_age = SUA_age.groupby(['SUA_NAME_2016','STATE_NAME_2016'])['15_19_yr','20_24_yr','25_34_yr','35_44_yr','45_54_yr','55_64_yr','65_74_yr','75_84_yr','85_yr_over','total_people'].sum()

,SUA_NAME_2016,STATE_NAME_2016,age_mode,total_people,popular_age_range
0,Adelaide,South Australia,175229,1042036,25 to 34 years-old
1,Albany,Western Australia,4347,26342,45 to 54 years-old
2,Albury - Wodonga (NSW),New South Wales,6440,40194,25 to 34 years-old
3,Albury - Wodonga (Vic.),Victoria,5428,30715,25 to 34 years-old
4,Alice Springs,Northern Territory,4427,21723,25 to 34 years-old
...,...,...,...,...,...
110,Warwick,Queensland,1884,11973,45 to 54 years-old
111,Whyalla,South Australia,3176,17458,45 to 54 years-old
112,Wollongong,New South Wales,37038,230356,45 to 54 years-old
113,Yanchep,Western Australia,1646,8673,25 to 34 years-old
114,Yeppoon,Queensland,2534,14613,55 to 64 years-old

In [20]:
######################################### state only #############################################################

# SUA_age = SUA_age.groupby(['STATE_NAME_2016'])['15_19_yr','20_24_yr','25_34_yr','35_44_yr','45_54_yr','55_64_yr','65_74_yr','75_84_yr','85_yr_over','total_people'].sum()
# SUA_age = SUA_age.reset_index()
# SUA_age['age_mode'] = SUA_age.iloc[:, 1:10].max(axis=1)
# SUA_age['popular_age_range'] = SUA_age.iloc[:, 1:10].idxmax(axis=1)
# SUA_age['popular_age_range'] = SUA_age['popular_age_range'].apply(extract_age_range)
# SUA_age['age_range_percentage'] = SUA_age['age_mode'] / SUA_age['total_people'] * 100
# SUA_puplar_age_range = SUA_age[['STATE_NAME_2016','age_mode','total_people','popular_age_range','age_range_percentage']]
# SUA_puplar_age_range.to_excel('state_age.xlsx')

## Combine 3 datasets

In [23]:
SUA_age_gender = pd.merge(SUA_puplar_age_range, SUA_gender, how='inner', on=['SUA_NAME_2016','STATE_NAME_2016'])
SUA_all = pd.merge(SUA_age_gender, SUA_employ, how='inner', on=['SUA_NAME_2016','STATE_NAME_2016'])
SUA_all.to_excel('SUA_SUDO_full_data.xlsx')